TDPortal/Utilities/EnhancedExposedServicesTestTool/ExposedServicesTestToolClient/Requests/FindNearest/V1/FindNearestService_FindNearestLocality.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <FindNearestLocality xmlns="http://www.transportdirect.info/TransportDirect.EnhancedExposedServices.FindNearest.V1">
      <transactionId>TransactionIdFindNearestLocality</transactionId>
      <language>en-GB</language>
      <gridReference>
        <Easting>531261</Easting>
        <Northing>182231</Northing>
      </gridReference>
    </FindNearestLocality>
  </soap:Body>
</soap:Envelope>